In [2]:
import pandas as pd
pd.__version__

'1.5.3'

In [3]:
pd?

In [5]:
data=pd.Series([3,4,2,1])
data[3]

1

In [6]:
data

0    3
1    4
2    2
3    1
dtype: int64

In [7]:
type(data)

pandas.core.series.Series

In [8]:
population_dict={'north america':2336489348,'europe':52382914783,'asia':13658411111136}
population=pd.Series(population_dict)
population

north america        2336489348
europe              52382914783
asia             13658411111136
dtype: int64

In [9]:
population['asia']

13658411111136

In [11]:
population['north america':'asia']

north america        2336489348
europe              52382914783
asia             13658411111136
dtype: int64

In [17]:
rainfall={
          1995:0.50,
          1996:0.45,
          1997:0.56,
          1998:0.34,
          1999:0.45,
          2000:0.12,
          2001:0.25,
          2002:0.43,
          2003:0.99,
         }
rainfall_data=pd.Series(rainfall)
rainfall_data

1995    0.50
1996    0.45
1997    0.56
1998    0.34
1999    0.45
2000    0.12
2001    0.25
2002    0.43
2003    0.99
dtype: float64

In [18]:
rainfall_data.mean()

0.45444444444444443

In [19]:
rainfall_data.mode()

0    0.45
dtype: float64

In [20]:
rainfall_data.median()

0.45

In [21]:
rainfall_data.max()

0.99

In [22]:
rainfall_data.min()

0.12

In [23]:
rainfall_data.cummax()

1995    0.50
1996    0.50
1997    0.56
1998    0.56
1999    0.56
2000    0.56
2001    0.56
2002    0.56
2003    0.99
dtype: float64

In [24]:
rainfall_data.cumsum()

1995    0.50
1996    0.95
1997    1.51
1998    1.85
1999    2.30
2000    2.42
2001    2.67
2002    3.10
2003    4.09
dtype: float64

In [25]:
rainfall_data.cumprod()

1995    0.500000
1996    0.225000
1997    0.126000
1998    0.042840
1999    0.019278
2000    0.002313
2001    0.000578
2002    0.000249
2003    0.000246
dtype: float64

In [26]:
rainfall_data.count()

9

In [27]:
rainfall_data.describe()

count    9.000000
mean     0.454444
std      0.241718
min      0.120000
25%      0.340000
50%      0.450000
75%      0.500000
max      0.990000
dtype: float64

In [28]:
rainfall_data.describe(include=object)

count    9.000000
mean     0.454444
std      0.241718
min      0.120000
25%      0.340000
50%      0.450000
75%      0.500000
max      0.990000
dtype: float64

In [29]:
rainfall_data.describe(include='all')

count    9.000000
mean     0.454444
std      0.241718
min      0.120000
25%      0.340000
50%      0.450000
75%      0.500000
max      0.990000
dtype: float64

In [30]:
rainfall_data.info

<bound method Series.info of 1995    0.50
1996    0.45
1997    0.56
1998    0.34
1999    0.45
2000    0.12
2001    0.25
2002    0.43
2003    0.99
dtype: float64>

In [31]:
rainfall_data.ndim

1

In [32]:
rainfall_data.shape

(9,)

In [34]:
data={'state':['telangana','andhra pradesh','maharastra','tamil nadu'],'year':[2004,2005,2006,2007],'pop':[20.1,34.5,11.7,10]}
frame=pd.DataFrame(data)
frame

            state  year   pop
0       telangana  2004  20.1
1  andhra pradesh  2005  34.5
2      maharastra  2006  11.7
3      tamil nadu  2007  10.0

In [36]:
frame=pd.DataFrame(data,columns=['year','pop','state'])
frame

   year   pop           state
0  2004  20.1       telangana
1  2005  34.5  andhra pradesh
2  2006  11.7      maharastra
3  2007  10.0      tamil nadu

In [37]:
frame.info

<bound method DataFrame.info of    year   pop           state
0  2004  20.1       telangana
1  2005  34.5  andhra pradesh
2  2006  11.7      maharastra
3  2007  10.0      tamil nadu>

In [38]:
frame.shape

(4, 3)

In [39]:
frame.ndim

2

In [40]:
frame.columns

Index(['year', 'pop', 'state'], dtype='object')

In [41]:
frame.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
frame.shape[0]

4

In [43]:
frame.shape[1]

3

In [44]:
frame.describe()

              year       pop
count     4.000000   4.00000
mean   2005.500000  19.07500
std       1.290994  11.19118
min    2004.000000  10.00000
25%    2004.750000  11.27500
50%    2005.500000  15.90000
75%    2006.250000  23.70000
max    2007.000000  34.50000

In [45]:
frame.describe(include='all')

               year       pop      state
count      4.000000   4.00000          4
unique          NaN       NaN          4
top             NaN       NaN  telangana
freq            NaN       NaN          1
mean    2005.500000  19.07500        NaN
std        1.290994  11.19118        NaN
min     2004.000000  10.00000        NaN
25%     2004.750000  11.27500        NaN
50%     2005.500000  15.90000        NaN
75%     2006.250000  23.70000        NaN
max     2007.000000  34.50000        NaN

In [46]:
frame.describe(include=object)

            state
count           4
unique          4
top     telangana
freq            1

In [48]:
frame['capital']=['hyderabad','amaravati','mumbai','chennai']
frame

   year   pop           state   capiital    capital
0  2004  20.1       telangana  hyderabad  hyderabad
1  2005  34.5  andhra pradesh  amaravati  amaravati
2  2006  11.7      maharastra     mumbai     mumbai
3  2007  10.0      tamil nadu    chennai    chennai